# back end develeopment-ბაქ ენდ დეველოპმენტი არის უმნიშვნელოვანესი ნაწილი რომელიც ამუშავებს ბრძანებებს ამა თუ იმ საიტზე
# რომელსაც საბოოლოო ჯამში მომხმარებელი უშუალოდ ვერ ხედავს მაგრამ ბაქ ენდის გარეშე ვებ საიტებზე მხოლოდ სტატიკური ინფორმაციის
# განთავსებას შევძლებთ.ბაკ ენდისგან განსხვავებით ვეპ დეველოპერი აკეთებს საიტის დიზაინს და ანთავსებს ინფორმაციას საიტზე.
# ვებ დეველოპერის დიზაინისა და ინფორმაციის უკან არის ბაკ ენდ დეველოპერი რომელიც უზრუნველყობს ყველა გაშვებული ბრძანების
# წესრიგს.fullstack-fullstack დეევლოპერი არის პერსონა რომელმაც იცის frontend და backendი.