variable = 12.4  
if type(variable) == float:
    print("ცვლადი არის float ტიპის")
else:
    print("ცვლადი არ არის float ტიპის")
#პირველ რიგში, ჩვენ გვაქვს ცვლადი variable, რომლის მნიშვნელობა არის 5.5. ეს რიცხვი არის float ტიპის, რაც ნიშნავს, რომ მას აქვს წერტილი.
#შემდეგ ჩვენ ვიყენებთ if-else, რათა შევამოწმოთ, არის თუ არა variable float ტიპის. 
#1 if type(variable) == float: – ამ ხაზზე ჩვენ ვამოწმებთ, შეესაბამება თუ არა variable float ტიპს. type(variable) ეუბნება, რომ რა ტიპის არის ცვლადი.
#2თუ variable არის float ტიპის, მაშინ ბეჭდავს print("ცვლადი არის float ტიპის") – ეს ნიშნავს, რომ ცვლადი არის float ტიპის.
#3 თუ variable არ არის float, მაშინ else ნაწილში print("ცვლადი არ არის float ტიპის") გამოუტანს იმას, რომ ცვლადი არ არის float ტიპის.