integer_number = 15
float_number = float(integer_number)
print(float_number)
#პირველ რიგში, ჩვენ გვაქვს ცვლადი integer_number, რომელიც არის მთელი რიცხვი (მაგალითად 10).
#შემდეგ ჩვენ ვიყენებთ float() ფუნქციას, რომელიც აქცევს ჩვენს integer_number რიცხვს ტიპში float. float ფუნქცია იღებს როგორც არგუმენტს მთელ რიცხვს და აბრუნებს მის ჩათვლით float ტიპში. შედეგად, ჩვენ ვიქმნით ცვლად float_number, რომელშიც დაიწერება ახალი float ტიპის რიცხვი.
#მაგალითად, 10 გადაეცემა float ფუნქციას და ხდება 10.0
#ბოლოს, print(float_number) გამოიტანს ტერმინალში ჩვენს ახალ float რიცხვს, რომელიც არის 10.0